Repository: mozilla-l10n/mt-training-data
Catalog: gwc/gwc_pontoon.tmx
Source language: en_us
Languages: gwc

source: If it’s your own words, just say <italicizedText>“Self Citation”</italicizedText>. We need to know where you found this content so that we can check it is in the public domain and no copyright restrictions apply. For more information about citation see our <guidelinesLink>Guidelines page</guidelinesLink>.
gwc: ائ لخہ چھاٞں تانی الفاظ تھو تے صرف<italicizedText> "ذاتی حوالہ" </italicizedText> من۔ ماکٞہ اِیں مالومات پکاٞر تھی اُوں تئ اِیں مواد کھنہ لد، اِیں نیں کیروں مٞہ آٞس چیک کٞری اُوں آیا اساں نقلاں حقیں پابندی ݭجوگیں کیر آٞس عوامی ڈومین مئ باتائی تہ۔ حوالہ داٞگ رہ دی مالوماتیں کیر مُوں <guidelinesLink> ہدایاتاں پاݪ </guidelinesLink> بیݭ۔

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
gwc: لخہ ریکارڈنگ کٞٹیر کٞٹیر آش، یا شراٞر آش تہ مسترد کٞرکتھائ سٞہ صابت متن نہ بُجباݭاٞت تہ۔

source: If there is additional information you want to provide about this file, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
gwc: لخہ اِیں فائیلاٞں باٞراٞ مئ تُو دی کٞہ مالومات پھݭانش تہ ماٞربینی کاٞ رابطہ کٞر <emailFragment>commonvoice@mozilla.com</emailFragment>

source: If there is additional information you want to provide about this file that is not included in the template, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
gwc: لخہ اِیں فائیلاٞں باٞراٞ مئ اضافی مالومات تھو تے سٞہ ئ ٹیمپلیٹ مئ شامل ناتھو تہ تے ماٞربینی کاٞ رابطہ کٞر<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If the sentence does not meet the above criteria, click the "No" button.
gwc: کٞہ جملہ رتٞہ داٞگاٞل معیار رہ پورہ نہ ہو، تُھکو نو آٞں بٹن وا دہ۔

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
gwc: لخہ جملہ رتہ داگاٞل طریقہ کاٞر رہ پورہ نانت تے، کھوری باٞمہ &quot; نامنظور کٞروگاں &quot; بٹن کلِک کٞر۔ لخہ تُو جملاٞں باراٞ مئی غیر یقینی تھو تے، تُو تھوکوآٞس چھیری دی کٞہ پا بچباں چو۔

source: If the sentence is offensive or upsetting - for example because of explicit content, or another violation of our <communityGuidelines>community participation guidelines</communityGuidelines> - you should reject the sentence. You can also reach out to us at <emailFragment>commonvoice@mozilla.com</emailFragment> to escalate the issue.
gwc: کچٞری اٞ جملہ لیݪ یا پریشان کٞروگ والہ ہی مثلاً اخکارہ مواد یا موں<communityGuidelines> خلٞکیں شراکیتاں معیار آں۔</communityGuidelines> دی خلاف ورزی آش تہ تھکو جملہ رد کٞروگ پکاٞر۔ تو ما سٞہ رابطہ کٞرباں <emailFragment> اcommonvoice@mozilla.com</emailFragment>ایں مسلاٞں باٞراٞ مئ۔

source: If the sentence meets the criteria above, click the "Yes" button.
gwc: کٞہ جملہ رتٞہ داٞگاٞل معیار رہ پورہ ہُو، تھوکو ییس آٞں بٹن وا دہ۔

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
gwc: لخہ جملہ طریقہ کاٞر رہ پورہ تھو تہ لاڄھیم پِیڄہ &quot; منظور کٞر&quot; والہ بٹن کلِک کٞر۔

source: If you are unsure about the sentence, you may also skip it and move on to the next one.
gwc: کٞہ تو جملاٞں باٞراٞمئ یقینی نہ ہو تو تاٞس چھورباں تے مُکٞہ بجباں دی کٞہ۔

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
gwc: لخہ اِچھلاں کٞہ شئ مُکہ یائ اُوں سٞہ اومی گائیڈلایٔنز مئ نہ آش تہ تھُکو باٞر صحیح طریقاٞ دہ اُٹ دہ، لخہ تو فیصلہ نہ کٞرباݭات تہ چھوروگاں بٹن اِستِمال کاٞ مِڄی ریکارڈنگ کٞہ چو۔

source: If you could <strong>hear them</strong> and <strong>understand them</strong>, it’s usually <strong>best to approve</strong>.
gwc: لخہ تو <strong> توم بُجبنش تہ </strong> تے تاٞس جانبنش تہ، <strong> اسوں منظور کٞروگ ران </strong>۔

source: If you don’t hear from us within a couple of days, reach out at <emailLink>{ $email }</emailLink> and we’ll get back to you!
gwc: لخہ تئی کٞتیک دوس مئی ما ماں نہ بُد تے، ما سہ <emailLink>{ $email }</emailLink>رابطہ کراٞ تے ما تھا سہ دیگیر رابطہ کٞری۔

source: If you don't see your language in either part of the platform, select both.
gwc: لخہ تھہ پلیٹ فاٞرماٞں کاٞں نی حصاٞ مئ تانی جِب نہ پشنش تہ، دواٞمو جُوݭ۔

source: If you or your organisation would like to contribute back to the project, you can make a <donateLink>donation</donateLink> or reach out to our partnerships team on <emailFragment>commonvoice@mozilla.com</emailFragment>.
gwc: کٞہ تو یا چھاں تنظیم پروجیکٹ سٞہ مداٞد کٞروگ خوشانت تہ تو<donateLink> چندہ</donateLink> دہ یا موں پارٹنرشپیں ٹیم سٞہ رابطہ کٞر <emailFragment>commonvoice@mozilla.com</emailFragment>۔

source: If you’re having trouble contributing, you can switch back to seeing all content for your language at any time.
gwc: لکہ تھاکہ مواد داٞگ مئی مسلہ تھو تے کانہ ٹیمہ تانی جِب مئی موجود مواد پشوگیں کیر پتکہ بجواٞں۔

source: If you’re looking for tools to build ASR models, you can connect to other people in the community <discourseLink>on Discourse</discourseLink>.
gwc: لخہ اے ایس آراں ماڈل چاگیں کیر آلہ باتانش تہ تو کمیونٹیاں دی خلک سٞہ <discourseLink> ڈِسکورس </discourseLink> دہ رابطہ کٞرباں۔

source: If you're looking to speak more about the dataset, want to co-invest in planned platform expansions or look for collaboration opportunities, <emailFragment>drop us a line.</emailFragment>
gwc: لخہ تو ڈیٹاسیٹاٞں باٞراٞ مئ دی جولاگ دِیانت تہ ، منصوبہ کٞراٞل پلیٹ فارمیں توسیع مئ مشترکہ سرمایہ کاری دیانت تہ یا سیتواٞل مئ کار باتانت تہ تے <emailFragment> کھٹن کٞہ ماکہ چُنڑ۔ </emailFragment>

source: If you run out of sentences to review, please help us collect more sentences!
gwc: لخہ تھکے جائیزیں کیر جملاٞ لاٞست تے، تھوکو ما سہ ماربینی کاٞ دی جملاٞ جمع کٞر۔

source: If you think the pronunciation makes it <strong>impossible to understand</strong>, or there’s a <strong>lot of background noise</strong>, or there are <strong>other people speaking too</strong>, then you should reject the clip. <accuracyLink>See more information in our accuracy criteria</accuracyLink>.
gwc: لخہ چھاں خیاٞل سٞہ تلفظ / ادائیگی اِچھلہ تھی اوں آٞساں <strong> جانوگ ممکن نات تہ </strong> ، یا ان مئ <strong> پس منظری ہؤو باٞر زیات تھی </strong> ، ان مئ <strong> دی خلک پا جولاٞنت </strong>، تھکو اساں مسترد کٞروگ پکاٞر۔ <accuracyLink> دی مالوماتیں کیر موں صِحت / صحی توپ آٞں اُصول بیر</accuracyLink> ۔

source: Igbo
gwc: اِگبو

source: I just created a personal goal for voice donation to #CommonVoice -- join me and help teach machines how real people speak { $link }
gwc: مئی سجہ #کامن وائیس مئی عطیہ ایں کیر اٞ ذاتی ہدف چائے تے مشین کہ چھاٞل پشائے اُوں اصل خلق کھیکی جولاٞں{ $link }

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
gwc: یہ تھئ سٞہ اِیں مالومات سماٞگ مئ براباٞر تھو کھیکی تئ واضح کیت موزیلا ایں <privacyLink>پرائویسی پالیسی مئ </privacyLink>

source: Include appropriate citation
gwc: موزوں حوالہ شامِل کٞر

source: Includes email, username & demographic info, available right away
gwc: شامل تھو ایمیل، نام تے بھاگاں مالومات فوری موجود تھو

source: Includes mp3s and related sentences, may take some time to prepare
gwc: شامل تھو mp3s تے تساٞں متعلق جملاٞ، کیدےشی تیار کٞروگ مئ اٞتوشی ٹیم گینٞگ۔

source: Indonesian
gwc: انڈونیشیائی

source: Indus Kohistani
gwc: انڈس کوہستانی

source: Information about the language
gwc: جِباٞں باراٞ مئی مالومات

source: In Progress
gwc: جاری تھی

source: Interested in getting involved with this project, or partnering with us?
gwc: اِیں پروجیکٹ یا شراکیت مئ ماں سٞہ شامل ہوگ خوش تھو آٞ؟

source: Interested in learning more and contributing to the project?
gwc: اِزدہ کٞروگ مئ تے تانی باٞم تھی حصہ تلوگ دِیانتاٞ؟

source: Interface language:
gwc: انٹرفیس ایں جِب؛

source: Interlingua
gwc: جِباں میہ

source: Interlingue
gwc: جِباں میہ

source: [interrupted by background noise]
gwc: [پس منظراٞں شور دہ مداخلت]

source: Intersex
gwc: ہیجڑہ

source: Iñupiaq
gwc: اینوپیاکی

source: Invalid file
gwc: ناقابل قبول فائیل

source: Irish
gwc: آئیریش

source: IsiNdebele (North)
gwc: ایسینڈبیلے (شمالی)

source: IsiNdebele (South)
gwc: ایسینڈبیلے (جنوبی)

source: <isoCodeLink>ISO Codes</isoCodeLink> if known
gwc: ISO<isoCodeLink> کوڈ</isoCodeLink>، لخہ تھکہ مالوم آش تہ

source: Is the clip valid?
gwc: اِیں کلپ صحی آٞ؟

source: Italian
gwc: اطالوی

source: It contains words or phrases that are hard to read or pronounce.
gwc: اٞن مئی اینچھلاٞں الفاٞظ یا فِقراٞ شامل ہُواٞنت اُوں تسوں ادا کٞروگ یا پروگ بکھاٞر تُھو۔

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do?
gwc: کاٞں خلک موں کاٞر رہ انحصار کٞرنت تہ تسوں کیر ڈیٹا سیٹونہ کٞہ بھاگ داٞگ تے 100 ما باٞر جِباٞں خلکیں کیر پلیٹ فارم بہتر کٞروگ رہ اٞ کالیں تقریباً داٞش لک ڈالر ݭجٞنت۔

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. <strong>If you value open, inclusive data - donate today!</strong>
gwc: موادیں سیٹ ساتوگیں کیر تے پنج بیش ما زیات جِباٞں ڈلاٞ کہ ران بھاگ داٞگیں کیر تقریباً داٞش لٞک ڈالر اٞ کاٞل مئی خرچہ ہواٞنت، اینیں کیر اُوں تام ما رہ انحصار کٞرنت۔ <strong>لخہ تھہ ایں موادیں قدر کٞرنش تے آج چندہ داٞ</strong>۔

source: It costs a lot of money to continually host and release the datasets, improve the platform and run <africaMradiLink>community programmes</africaMradiLink>.
gwc: مسلسل ڈیٹا سیٹونہ چاگ تے اسوں میزبانی کٞروگ رہ، تے اِیں پلیٹفارم مئ بہتری گھیاٞگ تے <africaMradiLink> کمیونٹی پروگرامز</africaMradiLink>چلاٞگ رہ باٞر خرچہ یاں۔

source: It is very important that all text sentences are <publicDomain>public domain</publicDomain> (cc0) as the Common Voice dataset is released under a cc0 license. Only ever upload a sentence if you are sure, and always include the relevant citation.
gwc: اٞئی باٞر اہم اوں سواٞ چُنڑاٞل جملاٞ <publicDomain> پبلک ڈومین </publicDomain> واٞلاٞ ہو دہ۔ کیکوں کامن وائیساں ڈیٹا سیٹ سی سی زیرو لائسنس آٞں بنیاد رہ جاری ہوانت۔ صرف تٞتھی جملہ بار کٞر اوں تٞھکٞہ یقین آش تہ، تے ہمیشہ ݭجاٞل حوالہ شامل کٞر۔

source: It is written in a language different than what I’m reviewing.
gwc: یہ کیں جِب مئ جائیزہ گِھننت تہ ائی تاٞس ما بدِیل جِب مئ چُنڑیل تھی۔

source: It is written in a language different than what I’m speaking.
gwc: یہ کیں جِبہ دیانت تہ ائی تاٞس ما بدِیل جِب مئ چُنڑیل تھی۔

source: It’s important to include citations so we can check that sentences are in the public domain and no copyright restriction apply.
gwc: حواٞلاٞ ݭاگ ضرولی کیکوں ان دہ مہ اِیں مالوم کٞرباٞں اوں اِیں جُملاٞ پبلک ڈومین مئ شامل تھو کو نہ تے ان رہ کاپی رائٹس ایں پابندی تھی کو نہ۔

source: It takes a lot to make Common Voice happen! We don't do it alone. Want to partner with us? We'd love to hear from you.
gwc: کامن وائیس چاجوگ مئ باٞر وخ شجاں! مٞہ آٞس اپان سٞہ نہ کرنت۔ ما سٞہ شریک ہوگ دیانتاٞ؟ مٞہ چھاں جواب بُجوگ دیاٞنت۔

source: Izhorian
gwc: اِژوری

source: Japanese
gwc: جاپانی

source: Jaqaru
gwc: خکارو

source: Javanese
gwc: جاوانی

source: Join Discord Community
gwc: ڈِسکورڈ گروپ مئی شامل ہو

source: Join the Common Voice mailing list
gwc: کامن وائس ایں ایمیلیں لسٹ مئی شامل ہو

source: Join us on Discord
gwc: ماسٞہ ڈِسکورڈ مئ شامل ہو

source: Just respond to the prompt as naturally as you can in a couple of sentences. Make sure your language is respectful and inoffensive.
gwc: اِشاٞراٞ کٞہ کتیک ممکن آش تہ تتیک قدرتی انداٞز دہ دوئ جُملاٞ مئ جواب دہ۔ خیال ساٞتوں چھیں جِب توہین آمیز تے خپہ کٞروگ والہ نہ ہوئ تہ۔

source: Just Unsure?
gwc: پھتہ نہ؟

source: Kabardian (East Circassian)
gwc: کباردی (مشرقی سرکاسی)

source: Kabyle
gwc: کابیل

source: Kalasha
gwc: کلاشہ

source: Kalenjin
gwc: کالینجی

source: Kalkoti
gwc: کلکوٹی

source: Kannada
gwc: کناڈا

source: Kaqchikel
gwc: کقچیکیل

source: Kara
gwc: کارا

source: Karakalpak
gwc: کراکالپاک

source: Kateviri
gwc: کٹاویری

source: Kazakh
gwc: قزاخی

source: { $kb }kb max
gwc: زیات نہ زیات { $kb } Kb

source: Keep
gwc: ساٞت

source: Keep it up, record again <recordIcon></recordIcon>
gwc: آٞس جاری ساٞت، دیگیراں ٹیپ کٞر۔</recordIcon><recordIcon>

source: Keep the recordings
gwc: ریکارڈِنگ جاری ساٞت۔

source: Keep track of your progress and metrics across multiple languages.
gwc: باٞر جِبونہ مئ حِساب تے ترقی آں ریکارڈ ساٞت۔

source: Keep track of your progress with a profile
gwc: تانی کاراں مِیڄکہ بچوگ اٞ پروفائل دہ چھٹاٞ

source: Keep track of your progress with a profile and help our voice data be more accurate.
gwc: تانی ترقی آں پتہ ݭا اٞ تفصیل دہ تے موں وائس مواد صحی ہوگ مئ مداٞد کٞر۔

source: Kelabit
gwc: کیلابِٹ

source: Kenyah
gwc: کینیا

source: Kenyi
gwc: کینئی

source: Ketrani
gwc: کیترانی

source: Khmer
gwc: خمیر

source: Khowar
gwc: کھوار

source: K'iche'
gwc: کیچے

source: Kichwa
gwc: کیچوا

source: Kidaw'ida
gwc: کڈاؤ اِڈا

source: Kikuyu
gwc: کیکویو

source: Kinyarwanda
gwc: کینیاروانڈا

source: Kohistani Shina
gwc: شینا کوہستانی

source: Kom
gwc: کوم

source: Komi-Zyrian
gwc: کومی زیریائی

source: Konkani (Devanagari)
gwc: کونکانی (دیوناگری)

source: Korean
gwc: کوریائی

source: Kuku
gwc: کوکو

source: Kurmanji Kurdish
gwc: کُرمانجی کُردی

source: Kyrgyz
gwc: کرغزی

source: Language
gwc: جِب

source: Language Fundamentals (e.g. Digits, Letters, Money)
gwc: جِباٞں بُنیاٞدی اجزاٞ (مثلاً ہندساٞ، حروف، روپئ)

source: Language Request
gwc: دیاگیل جِب

source: Language request successfully submitted, thank you.
gwc: جیباں درخاس کامیابی سہ لاڑاجین، ماربینی

source: Languages
gwc: جِبونہ

source: Languages can have their own validation rules with additional requirements when they localize. If there is no specific validation file for a language, the English rules will show for contributors.
gwc: جِیبوناں تصدیق کٞروگاں تانی قاٞنون آشآں مزید شرطونہ سمان کون اوم مقیمی ہی تہ۔ کٞہ اٞ جِب ایں کیر خاص تصدیقی فائل نہ ہی، انگریزی آٞں قاٞنون آٞس پشائی۔

source: Language Text
gwc: جِباں مواد

source: Lao
gwc: لاؤ

source: Large bulk sentence submission
gwc: گھاٞن اٞ جُملہ پیش کٞروگ

source: Large scale corporates and platform companies
gwc: گھاٞن پیماناٞں تجارتی اِداٞراٞ تے پلیٹ فارم والہ کٞپنیاٞن

source: Lassi
gwc: لاسی

source: Last Updated: { $lastUpdatedTimeStamp }
gwc: تازہ ترین اپڈیٹ{ $lastUpdatedTimeStamp }

source: Latgalian
gwc: لٹگالینی

source: Latvian
gwc: لٹویائی

source: Launched
gwc: بنیاد تھیت

source: Laz
gwc: لاذ

source: Leaderboard Visibility
gwc: لیڈربورڈ اخکارہ ہوگ

source: Learn about partnerships with Common Voice
gwc: کامن وائیس سٞہ شراکِتاٞں باٞراٞ مئ اِزدہ کٞر

source: Learn how to check a transcription
gwc: چُنڑاٞل چیک کٞروگاں چھاٞل اِزدہ کٞر

source: Learn how to take part
gwc: حِصہ گِھنوگاں چھاٞل اِزدہ کٞر

source: Learn how to transcribe
gwc: چُنڑوگاں چھاٞل اِزدہ کٞر

source: Learn how to use this page
gwc: اِیں پاݪاں استمال کٞروگاں چھاٞل اِزدہ کٞر

source: Learn More
gwc: دی مالوم کٞر

source: Leaving now means you’ll lose your changes
gwc: مُٹو چھوروگیں مطلاٞب اِینوں تو تانی بدلی ضائیع کٞرئ

source: Leaving now means you'll lose your progress
gwc: مُٹو چھوروگیں مطلاٞب اینوں تو تانی ترقی بائلٞگ

source: Length
gwc: لیگار

source: Let's Get Started
gwc: یہ اُوں شورو کٞری

source: Letters must be valid in the language being spoken. For example, “ж” is a letter in the Russian alphabet but is never used in English and so should never appear in any English source text.
gwc: حروف صحی پکاٞر کیں جِب مئ جولاٞنتہ۔ مثلاً “ж” اٞ ٹیکی تھی روسی حروف تہجی مئ پرہ اٞئی انگریزی مئ کھنٞہ ئ استمال نہ ہیت۔ اینیں کیر انگریزی ایں چُنڑیل ماٞکٞہ پکاٞر نہ کو یئی تہ۔

source: LibriSpeech is a corpus of approximately 1000 hours of 16Khz read English speech derived from read audiobooks from the LibriVox project.
gwc: لِبری سپیڄ اٞ تقریباً 1000 گینٹاں 16 کیلوہرٹز انگریزی جولاگ پر منی اٞ کارپس تھو تاٞس لبری واکس منصوباٞں ریڈ آڈیوبُک تھی گھِنت۔

source: License
gwc: لیسنس

source: License: <licenseLink>CC-0</licenseLink>
gwc: لیسنس: <licenseLink> CC-0 </licenseLink>

source: License: <licenseLink>{ $license }</licenseLink>
gwc: لیسنس: <licenseLink> { $license } </licenseLink>

source: Ligurian
gwc: لیگوریائی

source: Lingala
gwc: لینگالا

source: Link Copied
gwc: لنک نقل ہی

source: Links to websites that can help us understand the language
gwc: ویب سائیٹیں لنک، اُوں تن تھی ماکہ ایں جِباٞں باراٞ مئی پتہ ݭجئی

source: Listen
gwc: بُج

source: Listening
gwc: بُجوگ

source: Listen options menu
gwc: بُجوگاں اختیاراتیں لِسٹ

source: Listen-Queue
gwc: بُجوگاں قطار

source: Lithuanian
gwc: لیتھوانی

source: Loading…
gwc: پُورجنت۔۔۔۔

source: Loading sentences…
gwc: جُملاٞ اُکالینت…

source: Localized
gwc: مقیمی

source: Log In
gwc: داخیل ہو

source: Login Identity
gwc: لاگ اِن آئی ڈی

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
gwc: <loginLink> داخل ہو</loginLink> یا <loginLink> سائن اٞپ کٞر</loginLink> باٞر جُملاٞ مِلاگیں کیر

source: Log in or sign up to get started
gwc: شروع کٞروگیں کیر داخل ہو یا اپان داخل کٞر

source: Log In / Sign Up
gwc: داخل ہو / اپان داخل کٞر

source: Log In / Sign Up with { $company } email
gwc: لاگ اِن / سائن اپ کٞر{ $company } ای میل دہ

source: Log Out
gwc: لاگ آؤٹ

source: Lojban
gwc: لوجبان

source: Look for text where the copyright no longer applies - for example most books that were published before 1920
gwc: تٞتھی چُنڑاٞل بیݭ اوں تٞن راٞکٞہ کاپی رائٹ نہ ینش تہ مثلاً باٞر تٞتھی کتاٞبونہ اوں 1920 تھی مِڄ چاپ ہوش تہ۔

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
gwc: اِچھلہ مالوم ہوانتھوں اِیں جِب مئ بُجوگیں کیر کلِپونہ نات۔ ایں قطار ڈآک کٞروگیں کیر مُٹو ریکارڈنگ دہ موں اتوشی مداٞد کٞر۔

source: Luganda
gwc: لوگانڈا

source: Luxembourgish
gwc: لگزمبورگی

source: Macedonian
gwc: میسیڈونائی

source: Mada
gwc: مدا

source: Maithili
gwc: مائیتھیلی

source: Make sure the platform is recording before you start speaking, and that it only stops once you’re finished.
gwc: جولاگ شورو کٞروگ ما پھِرمال ہُب کٞروں پلیٹ فارم ریکارڈِنگ کرنت کو نہ، تے ائ صِرف تتھیں وخہ باس کٞرنتھوں کون تئ لاسائ تہ۔

source: Make sure the sentence meets the following criteria:
gwc: اِیں یقین کراٞ اُوں جملہ داگاٞل طریقہ کار رہ پورہ ینت؛

source: Make sure they can be answered in just a couple of sentences
gwc: اِیں کٞہ فِکر کٞر اوں تسوں جواب صِرف دوئ جمُلاٞ مئ داٞبئ تہ۔

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
gwc: تانی داٞگاٞل ڈیٹا کتیک ممکن آش تتیک باٞنام ڈیموگرافِک مالومات داٞ پورہ کٞر۔ مٞہ تمام ڈیموگرافک ڈیٹا پوت کٞروگ ما پھرمال غیرشناخت کٞرنت۔

source: Malagasy
gwc: ملاگاسی

source: Malay
gwc: مالائی

source: Malayalam
gwc: مالایالمی

source: Male/Masculine
gwc: مِیش‌/ مذکر

source: Maltese
gwc: مالٹیزی

source: Manage Email Subscriptions
gwc: ای میل سبسکرپشن آں انتظام کٞر

source: Manage Subscriptions
gwc: سبسکریپشن آں انتظام کٞر

source: Manx
gwc: مینگزی

source: Mapudungun
gwc: ماپوڈونگون

source: Marathi
gwc: مراٹھی

source: <mark>Check</mark>
gwc: <mark>چیک کٞر</mark>

source: <mark>Data</mark>
gwc: <mark>مواد</mark>

source: <mark>Prompt</mark>
gwc: <mark>اِشارہ</mark>

source: <mark>Respond</mark>
gwc: <mark>جواب دہ</mark>

source: <mark>Transcribe</mark>
gwc: <mark>نقل کٞر</mark>

source: <mark>Using CV for</mark><br/><mark>your research?</mark>
gwc: <mark>تانی تحقیقیں کیر سی وی</mark><br/><mark> استمال کٞرنتاٞ؟</mark>

source: <mark>We need</mark><br/><mark>your help!</mark>
gwc: <mark>ما کہ </mark><br/><mark>چھیں مددیں ضرولات تھی</mark>۔

source: Matrix is an open, lightweight protocol for decentralized, real-time communication, and Mozilla's preferred open discussion platform.
gwc: میٹرِکس اٞ کولاؤ تے تواٞں سطاٞ دہ تیزترین جولاگ پھݭاگاں اٞ پروٹوکول تھو، تے موزِلا آں باث کروگاں کولا ترجیحی پلیٹ فارم تھو۔

source: Maximum file size: 25 MB
gwc: فائیلیں زیات نہ زیات سیز: 25 MB

source: Maybe our <homepageLink>homepage</homepageLink> will help? To ask a question, please join the <matrixLink>Matrix community chat</matrixLink>, monitor site issues via <githubLink>GitHub</githubLink> or visit <discourseLink>our Discourse forums</discourseLink>.
gwc: شائد موں<homepageLink>ہوم پیج</homepageLink> مداٞد کٞربائی؟ اٞ سوالیں تٞپوس کٞروگیں کیر، ماٞربینی کاٞ شامل ہو<matrixLink> میٹریکس کمیونٹی چیٹ</matrixLink>مئ، سائیٹاٞں مسئلاٞ رہ نٞظاٞر ساٞتوگیں کیر<githubLink> گِٹ ہٞب رہ چو</githubLink> یا <discourseLink> مُوں ڈسکورس رہ بحثاٞں بھاگ کٞہ چو</discourseLink>

source: MB
gwc: ایم بی

source: Mbo
gwc: مبو

source: Meadow Mari
gwc: میڈو ماری

source: Media and Entertainment
gwc: میڈیا تے تفریچ

source: Medumba
gwc: میڈومبا

source: Meetei Lon
gwc: میٹی لون

source: Message
gwc: پیغام

source: Michoacán Mazahua
gwc: میچواکاٞن مزاحواٞ

source: Mingrelian
gwc: مینگریلی

source: Minimum sentences in file: 1000
gwc: فائیل مئ کٞم از کٞم جُملاٞ : 1000

source: [Mismatched content]
gwc: غلط موازنہ کٞراٞل شئیونہ

source: Misreadings
gwc: کھوچہ پروگ

source: Missing an 's' at the end of a word.
gwc: اٞ لفظ آٞں آخرہ 'S' چھوروگ۔

source: Missing an <strong>'s'</strong> at the end of a word.
gwc: اٞ لفظاٞں آٞخیر مئ <strong> س </strong> چھوروگ۔

source: Missing 'A' or 'The' at the beginning of the recording.
gwc: ٹیپ کٞروگاٞں اٞواٞلہ 'A' یا'The' چھوروگ۔

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
gwc: ریکارڈِنگاٞں شورو مئ <strong> "اٞ" </strong> یا <strong> "دی" </strong> چھوروگ۔

source: Missing the end of the last word by cutting off the recording too quickly.
gwc: ریکارڈنگ شردہ کاٹ کٞروگ دہ نیپتوگ لفظاں دُوت نات۔

source: Mixed
gwc: مِلاگاٞل

source: Mixteco Yucuhiti
gwc: مکسٹیکو یوکوہیٹی

source: Mokpwe
gwc: موکپوے

source: Moksha
gwc: موکشا

source: Mongolian
gwc: منگولائی

source: More
gwc: دی

source: [More has been recorded than the required text]
gwc: [کتیک متن پکاٞر آش تاٞس ما زیات ریکارڈ ہِت]

source: More languages coming soon
gwc: دی جِیبونہ شاٞردہ یینت

source: Mossi
gwc: موسی

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
gwc: گِھین کپنیاٞن کاں ڈیٹا استمال کٞرنت تہ سٞہ خلکیں اکثریت کٞہ گاشی نہ بچنت مُوں اِیں خیال تھو اُوں ائ نِیماررٹینت۔ تیتھی مٞہ کامن وائیس آٞں منصوبہ شورو کِیر، ائ ہاٞراٞکیں کیر ہواز پُیانوگ پوت کٞروگ تے قابِل رسائ کٞروگ مئ مداٞد کٞروگاں منصوبہ تھو۔

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
gwc: گِھین کپنیاٞن کاں ڈیٹا استمال کٞرنت تہ سٞہ خلکیں اکثریت کٞہ گاشی نہ بچنت مُوں اِیں خیال تھو اُوں ائ نِیماررٹینت۔ تیتھی مٞہ کامن وائیس آٞں منصوبہ چالو کِیر، ائ ہاٞراٞکیں کیر ہواز پُیانوگ کٞہ رسائی مئ مداٞد کٞروگاں منصوبہ تھو۔

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
gwc: اکثاٞر ریکارڈنگ تتھیں خلکیں تھی اُوں توم تانی قدرتی ہواٞزدہ جولاٞنش تہ۔ تو آٞک نِیم غیر معیاری ٹاکاروگ، څُھپ څُھپ کٞروگ یا واضح طور دہ "ڈرامائ" ہواٞز مئ مناٞل قبولباں۔ رو داٞگاٞل تے کمپیوٹر دہ تیار کٞراٞل ہواٞز مسترد کٞر۔

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
gwc: موذلاٞ کامن وائیس مشین کٞہ اصلی انساٞناٞں چھلہ جولاگاں چھاٞل پشاٞگ مئ مداٞد کٞروگاں اٞ قداٞم تھو۔
